code-review/NRB_3471_3546/База_Было/InformationRegisters/ПрисутствиеНаТерриторииРФ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПрисутствиеНаТерриторииРФ</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Местонахождение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыМестонахожденияКлиента</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/CommonModules/ДанныеФизлиц/Ext/Module.bsl
// Этот модуль предназачен для реализации алгоритмов работы 
// с контактной информацией по физическим лицам.

//Функция возвращает последнее гражданство физлица на текущую дату.
//
// Параметры
//  ФизЛицо  – СправочникСсылка.ФизическиеЛица. 
//  
// Возвращаемое значение:                 
//       СправочникСсылка.КлассификаторСтранМира.
//
Функция ФизЛицоГражданство(ФизЛицо)  Экспорт 

	 СтруктураОтбора	 = Новый Структура("ФизЛицо",ФизЛицо);
	 Результат 			 = РегистрыСведений.ГражданствоФизЛиц.ПолучитьПоследнее(ТекущаяДата(),СтруктураОтбора);
	 
     Возврат Результат.Страна;               
	 
КонецФункции // ФизЛицоГражданство(ФизЛицо)
 
// Функция возвращает структуру паспортных данных.
//
// Параметры
//  ФизЛицо  – СправочникСсылка.ФизическиеЛица. 
//                 
// Возвращаемое значение:
//   Структура - по РегиструСвединий
//
Функция ФизЛицоПаспорт(ФизЛицо) Экспорт 
	
     СтруктураОтбора	 = Новый Структура("ФизЛицо",ФизЛицо);
	 Результат 			 = РегистрыСведений.ПаспортныеДанныеФизЛиц.ПолучитьПоследнее(ТекущаяДата(),СтруктураОтбора);
	 
     Возврат Результат;               

КонецФункции // ФизЛицоПаспорт(ФизЛицо)
 
Функция ЯвляетсяНалоговымРезидентом(ДатаРасчета, Клиент) Экспорт
	
	Если ТипЗнч(Клиент) = Тип("СправочникСсылка.Контрагенты") Тогда
		Контрагент = Клиент;
		ЮрФизЛицо = Клиент.ЮридическиеФизическиеЛица;
	Иначе
		ЮрФизЛицо = Клиент;
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Контрагент
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ЮридическиеФизическиеЛица = &Клиент
		|	И НЕ Контрагенты.ПометкаУдаления");
		Запрос.УстановитьПараметр("Клиент", ЮрФизЛицо);
		Результат = Запрос.Выполнить().Выбрать();
		Если Результат.Следующий() Тогда
			Контрагент = Результат.Контрагент;
		КонецЕсли;
	КонецЕсли;	
	
	Если ТипЗнч(ЮрФизЛицо) = Тип("СправочникСсылка.ЮридическиеЛица") Тогда
		Возврат НЕ Контрагент.НеРезидент;		
	КонецЕсли;
	
	//дальше только физ лица
	НеРезидент = Контрагент.НеРезидент;
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ГражданствоФизЛиц.НеЯвляетсяНалоговымРезидентомРФ КАК НеРезидент
	|ИЗ
	|	РегистрСведений.ГражданствоФизЛиц.СрезПоследних(&ДатаРасчета, ФизЛицо = &ФизЛицо) КАК ГражданствоФизЛиц");
	Запрос.УстановитьПараметр("ФизЛицо", ЮрФизЛицо);
	Запрос.УстановитьПараметр("ДатаРасчета", ДатаРасчета);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		НеРезидент = Выборка.НеРезидент;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПрисутствиеНаТерриторииРФ.Клиент КАК Контрагент,
	|	СУММА(ВЫБОР
	|			КОГДА ПрисутствиеНаТерриторииРФ.Местонахождение = ЗНАЧЕНИЕ(Перечисление.ТипыМестонахожденияКлиента.НаТерриторииРФ)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК РФ,
	|	СУММА(ВЫБОР
	|			КОГДА ПрисутствиеНаТерриторииРФ.Местонахождение = ЗНАЧЕНИЕ(Перечисление.ТипыМестонахожденияКлиента.ВнеТерриторииРФ)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НеРФ
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрисутствиеНаТерриторииРФ.СрезПоследних(
	|				&ДатаРасчета,
	|				Дата >= ДОБАВИТЬКДАТЕ(&ДатаРасчета, МЕСЯЦ, -12)
	|					И Дата <= &ДатаРасчета
	|					И Клиент = &Клиент) КАК ПрисутствиеНаТерриторииРФ
	|		ПО Контрагенты.Ссылка = ПрисутствиеНаТерриторииРФ.Клиент
	|ГДЕ
	|	Контрагенты.Ссылка = &Клиент
	|
	|СГРУППИРОВАТЬ ПО
	|	ПрисутствиеНаТерриторииРФ.Клиент";

	Запрос.УстановитьПараметр("ДатаРасчета", ДатаРасчета);
	Запрос.УстановитьПараметр("Клиент"	   , Контрагент);
	
	ТЗРезультат = Запрос.Выполнить().Выгрузить();	
	
	СчетчикВРФ = 0;
	СчетчикВнеРФ = 0;
	
	Если ТЗРезультат.Количество() > 0 Тогда
		СчетчикВРФ = ТЗРезультат[0].РФ;
		СчетчикВнеРФ = ТЗРезультат[0].НеРФ;
	КонецЕсли;
	
	Если (НеРезидент И СчетчикВРФ >= 183) ИЛИ (НЕ НеРезидент И СчетчикВнеРФ < 183) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции
